Revit 2024 API
GroupTypeId.EnergyAnalysisDetailedAndConceptualModels Property
 Essential.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId EnergyAnalysisDetailedAndConceptualModels { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisDetailedAndConceptualModels As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisDetailedAndConceptualModels {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace